RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_tcpwm_common.c
/*******************************************************************************
*       TCPWM Shared HAL Functions
*******************************************************************************/

void _cyhal_tcpwm_free(cyhal_tcpwm_t *obj)
{
    CY_ASSERT(NULL != obj);

    _cyhal_system_irq_t irqn = (_cyhal_system_irq_t)(_CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->resource.block_num)].isr_offset + obj->resource.channel_num);
    _cyhal_irq_free(irqn);

    if (NULL != obj->base)
    {
        _cyhal_tcpwm_data_structs[_CYHAL_TCPWM_GET_ARRAY_INDEX(_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->resource.block_num), obj->resource.channel_num)] = NULL;
        if (!_cyhal_tcpwm_pm_has_enabled())
        {
            _cyhal_syspm_unregister_peripheral_callback(&_cyhal_tcpwm_syspm_callback_data);
        }

#if defined(CY_IP_M0S8PERI_TR) || defined(CY_IP_MXPERI_TR) || defined(CY_IP_MXSPERI)
        for (uint8_t i = 0; i < _CYHAL_TCPWM_OUTPUTS; i++)
        {
            _cyhal_tcpwm_disable_output(obj, (cyhal_tcpwm_output_t)i);
        }
        for (uint8_t i = 0; i < _CYHAL_TCPWM_INPUTS; i++)
        {
            if (CYHAL_TRIGGER_CPUSS_ZERO != obj->inputs[i])
            {
                _cyhal_tcpwm_disconnect_digital(obj, obj->inputs[i], (cyhal_tcpwm_input_t)i);
            }
        }
#endif

        #if defined(CY_IP_MXTCPWM) && (CY_IP_MXTCPWM_VERSION >= 2)
        Cy_TCPWM_Disable_Single(obj->base, _CYHAL_TCPWM_CNT_NUMBER(obj->resource));
        #else
        Cy_TCPWM_PWM_Disable(obj->base, _CYHAL_TCPWM_CNT_NUMBER(obj->resource));
        #endif

        if(false == obj->owned_by_configurator)
        {
            cyhal_hwmgr_free(&(obj->resource));
        }

        obj->base = NULL;
        obj->resource.type = CYHAL_RSC_INVALID;
    }

    if (obj->dedicated_clock)
    {
        en_clk_dst_t pclk = (en_clk_dst_t)(_CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(obj->resource.block_num)].clock_dst + obj->resource.channel_num);
        cy_rslt_t rslt = _cyhal_utils_peri_pclk_disable_divider(pclk, &(obj->clock));
        CY_UNUSED_PARAMETER(rslt); /* CY_ASSERT only processes in DEBUG, ignores for others */
        CY_ASSERT(CY_RSLT_SUCCESS == rslt);
        cyhal_clock_free(&(obj->clock));
        obj->dedicated_clock = false;
    }
}

void _cyhal_tcpwm_register_callback(cyhal_resource_inst_t *resource, cy_israddress callback, void *callback_arg)
{
    uint8_t index = _CYHAL_TCPWM_GET_ARRAY_INDEX(resource->block_num, resource->channel_num);
    uint32_t savedIntrStatus = cyhal_system_critical_section_enter();
    _cyhal_tcpwm_data_structs[index]->callback_data.callback = callback;
    _cyhal_tcpwm_data_structs[index]->callback_data.callback_arg = callback_arg;
    cyhal_system_critical_section_exit(savedIntrStatus);

    _cyhal_system_irq_t irqn = (_cyhal_system_irq_t)(_CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(resource->block_num)].isr_offset + resource->channel_num);
    /* Only enable if it's not already enabled */
    if (false == _cyhal_irq_is_enabled(irqn))
    {
        _cyhal_irq_register(irqn, CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_tcpwm_irq_handler);
        _cyhal_irq_enable(irqn);
    }
}

void _cyhal_tcpwm_enable_event(TCPWM_Type *type, cyhal_resource_inst_t *resource, uint32_t event, uint8_t intr_priority, bool enable)
{
    uint32_t old_mask = Cy_TCPWM_GetInterruptMask(type, _CYHAL_TCPWM_CNT_NUMBER(*resource));
    if (enable)
    {
        // Clear any newly enabled events so that old IRQs don't trigger ISRs
        Cy_TCPWM_ClearInterrupt(type, _CYHAL_TCPWM_CNT_NUMBER(*resource), ~old_mask & event);
    }
    Cy_TCPWM_SetInterruptMask(type, _CYHAL_TCPWM_CNT_NUMBER(*resource), enable ? (old_mask | event) : (old_mask & ~event));

    _cyhal_system_irq_t irqn = (_cyhal_system_irq_t) (_CYHAL_TCPWM_DATA[_CYHAL_TCPWM_ADJUST_BLOCK_INDEX(resource->block_num)].isr_offset + resource->channel_num);
    _cyhal_irq_set_priority(irqn, intr_priority);
}

#if (CY_IP_MXTCPWM_VERSION == 2U)
static uint8_t _cyhal_tcpwm_convert_output_t(cyhal_tcpwm_output_t signal)
{
    switch(signal)
    {
        case CYHAL_TCPWM_OUTPUT_OVERFLOW:
            return CY_TCPWM_CNT_TRIGGER_ON_OVERFLOW;
        case CYHAL_TCPWM_OUTPUT_UNDERFLOW:
            return CY_TCPWM_CNT_TRIGGER_ON_UNDEFLOW;
        case CYHAL_TCPWM_OUTPUT_TERMINAL_COUNT:
            return CY_TCPWM_CNT_TRIGGER_ON_TC;
        case CYHAL_TCPWM_OUTPUT_COMPARE_MATCH:
            return CY_TCPWM_CNT_TRIGGER_ON_CC0_MATCH;
        case CYHAL_TCPWM_OUTPUT_LINE_OUT:
            return CY_TCPWM_CNT_TRIGGER_ON_LINE_OUT;
        default:
            CY_ASSERT(false);
            return 0;
    }
}
#endif

#if defined(CY_IP_M0S8PERI_TR) || defined(CY_IP_MXPERI_TR) || defined(CY_IP_MXSPERI)
#if (CY_IP_MXTCPWM_VERSION == 1U) ||(CY_IP_MXTCPWM_VERSION == 2U) || (CY_IP_M0S8TCPWM_VERSION == 2)
// Assumes trig_index is not offset by _CYHAL_TCPWM_TRIGGER_INPUTS_IDX_OFFSET
// (that is, it is 0 indexed).
cyhal_dest_t _cyhal_tpwm_calculate_dest(uint8_t block, uint8_t trig_index)
{
#if (CY_IP_MXTCPWM_VERSION == 1U)
    if(block == 0)
    {
        return (cyhal_dest_t)(CYHAL_TRIGGER_TCPWM0_TR_IN0 + trig_index);
    }
    else
    {
        CY_ASSERT(block == 1);
        return (cyhal_dest_t)(CYHAL_TRIGGER_TCPWM1_TR_IN0 + trig_index);
    }
#elif (CY_IP_MXTCPWM_VERSION == 2U)
    #if (CY_IP_MXTCPWM_INSTANCES == 2)
    return (cyhal_dest_t)(_CYHAL_TCPWM_GET_IP_BLOCK(block) == 0 ? (CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN0 + \
            trig_index) : (CYHAL_TRIGGER_TCPWM1_TR_ALL_CNT_IN0 + trig_index));
    #else
    CY_UNUSED_PARAMETER(block);
    return (cyhal_dest_t)(CYHAL_TRIGGER_TCPWM0_TR_ALL_CNT_IN0 + trig_index);
    #endif
#elif (CY_IP_M0S8TCPWM_VERSION == 2)
    CY_UNUSED_PARAMETER(block);
#if defined(CY_DEVICE_PSOC4AS1)
    CY_ASSERT(block == 0);
    return (cyhal_dest_t)(CYHAL_TRIGGER_TCPWM_TR_IN12 + trig_index);
#elif defined(CY_DEVICE_PMG1S3) || defined(CY_DEVICE_CCG7S)
    CY_ASSERT(block == 0);
    return (cyhal_dest_t)(CYHAL_TRIGGER_TCPWM_TR_IN8 + trig_index);
#else
    CY_ASSERT(block == 0);
    return (cyhal_dest_t)(CYHAL_TRIGGER_TCPWM_TR_IN7 + trig_index);
#endif
#endif
}
#endif

#if (CY_IP_MXTCPWM_VERSION == 1U) || (CY_IP_M0S8TCPWM_VERSION == 2)
static cyhal_source_t _cyhal_tcpwm_calculate_source(uint8_t block, uint8_t chnl, cyhal_tcpwm_output_t signal)
{
#if (CY_IP_MXTCPWM_VERSION == 1U)
    switch(signal)
    {
        case CYHAL_TCPWM_OUTPUT_OVERFLOW:
            return block == 0
                ? (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW0 + chnl, CYHAL_SIGNAL_TYPE_EDGE)
                : (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW0 + chnl, CYHAL_SIGNAL_TYPE_EDGE);
        case CYHAL_TCPWM_OUTPUT_UNDERFLOW:
            return block == 0
                ? (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW0 + chnl, CYHAL_SIGNAL_TYPE_EDGE)
                : (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW0 + chnl, CYHAL_SIGNAL_TYPE_EDGE);
        case CYHAL_TCPWM_OUTPUT_COMPARE_MATCH:
            #if defined(COMPONENT_CAT1B)
            return block == 0
                ? (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM0_TR_CC_MATCH0 + chnl, CYHAL_SIGNAL_TYPE_EDGE)
                : (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM1_TR_CC_MATCH0 + chnl, CYHAL_SIGNAL_TYPE_EDGE);
            #else
            return block == 0
                ? (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH0 + chnl, CYHAL_SIGNAL_TYPE_EDGE)
                : (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH0 + chnl, CYHAL_SIGNAL_TYPE_EDGE);
            #endif
       default:
            // Should never reach here
            CY_ASSERT(false);
            return CYHAL_TRIGGER_CPUSS_ZERO;
    }
#elif (CY_IP_M0S8TCPWM_VERSION == 2)
    CY_UNUSED_PARAMETER(block);
    switch(signal)
    {
        case CYHAL_TCPWM_OUTPUT_OVERFLOW:
            return (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM_TR_OVERFLOW0 + chnl, CYHAL_SIGNAL_TYPE_EDGE);
        case CYHAL_TCPWM_OUTPUT_UNDERFLOW:
            return (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM_TR_UNDERFLOW0 + chnl, CYHAL_SIGNAL_TYPE_EDGE);
        case CYHAL_TCPWM_OUTPUT_COMPARE_MATCH:
            return (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM_TR_COMPARE_MATCH0 + chnl, CYHAL_SIGNAL_TYPE_EDGE);
       default:
            // Should never reach here
            CY_ASSERT(false);
            return CYHAL_TRIGGER_CPUSS_ZERO;
    }
#endif
}
#elif (CY_IP_MXTCPWM_VERSION == 2U)
static cyhal_source_t _cyhal_tcpwm_calculate_source(uint8_t out_trig_idx, uint8_t free_trig)
{
    // Triggers are ordered by output trig idx, then block, then channel.
    // Offsetting by out_trig_idx is sufficient to get the correct trigger.
    if(free_trig == 0)
    {
        return (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM0_TR_OUT00 + out_trig_idx, CYHAL_SIGNAL_TYPE_EDGE);
    }
    else if(free_trig == 1)
    {
        return (cyhal_source_t)_CYHAL_TRIGGER_CREATE_SOURCE(_CYHAL_TRIGGER_TCPWM0_TR_OUT10 + out_trig_idx, CYHAL_SIGNAL_TYPE_EDGE);
    }
    else
    {
        // Should never reach here
        CY_ASSERT(false);
        return CYHAL_TRIGGER_CPUSS_ZERO;
    }
}
#endif
#endif /* defined(CY_IP_M0S8PERI_TR) || defined(CY_IP_MXPERI_TR) || defined(CY_IP_MXSPERI) */

