RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_tcpwm_common.c
    cyhal_dest_t dest = _cyhal_tpwm_calculate_dest(block, trig_index);

    cy_rslt_t rslt = _cyhal_disconnect_signal(source, dest);
    if (CY_RSLT_SUCCESS == rslt)
    {
        obj->inputs[(uint32_t)signal] = CYHAL_TRIGGER_CPUSS_ZERO;
    }
    return rslt;
#else
    CY_UNUSED_PARAMETER(obj);
    CY_UNUSED_PARAMETER(signal);
    CY_UNUSED_PARAMETER(source);
    return CYHAL_TCPWM_RSLT_ERR_BAD_ARGUMENT;
#endif /* defined(CY_IP_M0S8PERI_TR) || defined(CY_IP_MXPERI_TR) || defined(CY_IP_MXSPERI) */
}

cy_rslt_t _cyhal_tcpwm_disable_output(cyhal_tcpwm_t *obj, cyhal_tcpwm_output_t signal)
{
#if defined(CY_IP_M0S8PERI_TR) || defined(CY_IP_MXPERI_TR) || defined(CY_IP_MXSPERI)
// Triggers are always generated for TCPWMv1 so this is a noop.
#if (CY_IP_MXTCPWM_VERSION == 1U) || (CY_IP_M0S8TCPWM_VERSION == 2)
    CY_UNUSED_PARAMETER(obj);
    CY_UNUSED_PARAMETER(signal);

    return CY_RSLT_SUCCESS;
#elif (CY_IP_MXTCPWM_VERSION == 2U)
    const uint8_t block = obj->resource.block_num;
    const uint8_t chnl = obj->resource.channel_num;

    uint8_t event_type = _cyhal_tcpwm_convert_output_t(signal);

    // All channels in _CYHAL_OUTPUT_TRIGGERS_USED are just ordered
    // sequentially, not ordered by blocks.
    uint8_t trig_index = _CYHAL_TCPWM_GET_ARRAY_INDEX(block, chnl);

    if(_FLD2VAL(TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT0, TCPWM_GRP_CNT_TR_OUT_SEL(obj->base, _CYHAL_TCPWM_GET_GRP(block), \
                _CYHAL_TCPWM_CNT_NUMBER(obj->resource))) == event_type)
    {
        // Disable output trigger idx 0
        TCPWM_GRP_CNT_TR_OUT_SEL(obj->base, _CYHAL_TCPWM_GET_GRP(block), _CYHAL_TCPWM_CNT_NUMBER(obj->resource)) \
                                 &= ~TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT0_Msk;
        TCPWM_GRP_CNT_TR_OUT_SEL(obj->base, _CYHAL_TCPWM_GET_GRP(block), _CYHAL_TCPWM_CNT_NUMBER(obj->resource)) \
                                 |= _VAL2FLD(TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT0, CY_TCPWM_CNT_TRIGGER_ON_DISABLED);
        _CYHAL_OUTPUT_TRIGGERS_USED[trig_index] &= ~1;
    }
    else if(_FLD2VAL(TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT1, TCPWM_GRP_CNT_TR_OUT_SEL(obj->base, _CYHAL_TCPWM_GET_GRP(block), \
                     _CYHAL_TCPWM_CNT_NUMBER(obj->resource))) == event_type)
    {
        // Disable output trigger idx 1
        TCPWM_GRP_CNT_TR_OUT_SEL(obj->base, _CYHAL_TCPWM_GET_GRP(block), _CYHAL_TCPWM_CNT_NUMBER(obj->resource)) \
                                 &= ~TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT1_Msk;
        TCPWM_GRP_CNT_TR_OUT_SEL(obj->base, _CYHAL_TCPWM_GET_GRP(block), _CYHAL_TCPWM_CNT_NUMBER(obj->resource)) \
                                 |= _VAL2FLD(TCPWM_GRP_CNT_V2_TR_OUT_SEL_OUT1, CY_TCPWM_CNT_TRIGGER_ON_DISABLED);
        _CYHAL_OUTPUT_TRIGGERS_USED[trig_index] &= ~2;
    }
    else
        return CYHAL_TCPWM_RSLT_ERR_BAD_ARGUMENT;

    return CY_RSLT_SUCCESS;
#else
#error "Unrecognized TCPWM version"
#endif
#else
    CY_UNUSED_PARAMETER(obj);
    CY_UNUSED_PARAMETER(signal);

    return CYHAL_TCPWM_RSLT_ERR_BAD_ARGUMENT;
#endif /* defined(CY_IP_M0S8PERI_TR) || defined(CY_IP_MXPERI_TR) || defined(CY_IP_MXSPERI) */
}

#if defined(__cplusplus)
}
#endif

#endif /* _CYHAL_DRIVER_AVAILABLE_TCPWM */
